function [signal_out,I_out,Q_out,phase,gt,qt] = mod_gmsk(data,data_len,sample_number,Rb,alpha)
%GMSK基带调制
%**************************************************************************
% data              调制信号
% data_len          码元个数
% sample_number     每个码元采样点数
% Rb                码元速率
% signal_out        基带调制输出
% I_out             I路输出
% Q_out             Q路输出
% alpha             alpha = Bb*Tb = Bb/Rb
%**************************************************************************

% data_len = 10;                %码元个数
% sample_number = 8;            %采样点数
% Rb = 16000;                   %码元速率
% alpha = 0.25;                 %BbTb值
% data1 = randint(1,data_len);  
% data = 2*data1-1;             %传输的序列

Tb = 1/Rb;                      %码元时间
Bb = alpha/Tb;                  %调制高斯滤波器3dB带宽
fs = Rb*sample_number;          %采样速率

%--------------------------------------------------------------------------
%高斯滤波器
[gt,qt] = gauss_filter(Bb,Tb,fs,sample_number);
%**************************************************************************

%--------------------------------------------------------------------------
%相位
phase = gmsk_phase(data,data_len,sample_number,qt);
%**************************************************************************

%--------------------------------------------------------------------------
%调制信号产生
I_out = cos(phase);
Q_out = sin(phase);
signal_out = I_out + j*Q_out;
%**************************************************************************